package com.xmsy.server.zxyy.manager.constant;

import java.util.HashMap;

/**
 * 
 * 牌常量定义
 * 
 * @author Administrator
 *
 */
public class CardsConstants {

	/**
	 * 卡牌数字和名称的对应数组
	 */
	public static final String CARD_ARRAY[] = new String[] { "0", "方块A", "方块2", "方块3", "方块4", "方块5", "方块6", "方块7",
			"方块8", "方块9", "方块10", "方块J", "方块Q", "方块K", "14", "15", "16", "梅花A", "梅花2", "梅花3", "梅花4", "梅花5", "梅花6",
			"梅花7", "梅花8", "梅花9", "梅花10", "梅花J", "梅花Q", "梅花K", "30", "31", "32", "红桃A", "红桃2", "红桃3", "红桃4", "红桃5",
			"红桃6", "红桃7", "红桃8", "红桃9", "红桃10", "红桃J", "红桃Q", "红桃K", "46", "47", "48", "黑桃A", "黑桃2", "黑桃3", "黑桃4",
			"黑桃5", "黑桃6", "黑桃7", "黑桃8", "黑桃9", "黑桃10", "黑桃J", "黑桃Q", "黑桃K", "62", "63", "64", "小王", "大王" };

	public static final HashMap<String, String> PAIJIU_MAP = new HashMap<String, String>() {
		/**
		 * 
		 */
		private static final long serialVersionUID = 1L;

		{
			put("38-35", "至尊");
			put("12-12", "天托");
			put("2-2", "地托");
			put("8-8", "人托");
			put("4-4", "爷托");
			put("10-10", "梅托");
			put("6-6", "长托");
			put("20-20", "板凳");
			put("11-11", "虎头");
			put("26-26", "红头");
			put("7-7", "高脚");
			put("22-22", "铜锤");
			put("41-57", "武九");
			put("40-56", "武八");
			put("39-55", "武七");
			put("37-53", "武五");
			put("12-41", "天高王");
			put("12-57", "天地王");
			put("2-41", "地高王");
			put("2-57", "地地王");
			put("12-8", "天杠");
			put("12-40", "天八");
			put("12-56", "天贯");
			put("2-8", "地杠");
			put("2-40", "地八");
			put("2-56", "地贯");
			// ===========================九点===================================
			put("12-7", "天高九");
			put("12-39", "天中九");
			put("12-55", "天地九");
			put("2-7", "地高九");
			put("2-39", "地中九");
			put("2-55", "地地九");
			put("8-11", "人九");
			put("4-37", "爷高九");
			put("4-53", "爷地九");
			put("10-41", "梅高九");
			put("10-57", "梅地九");
			put("6-38", "长高九");
			put("6-35", "长地九");
			put("20-37", "凳高九");
			put("20-53", "凳地九");
			put("11-40", "虎高九");
			put("11-56", "虎地九");
			put("26-41", "红头九");
			put("10-57", "屏风九");
			put("22-38", "铜高九");
			put("22-35", "铜地九");
			// =========================八点===================================
			put("12-6", "天长八");
			put("12-22", "天王八");
			put("12-38", "天高八");
			put("12-35", "天地八");
			put("2-6", "地长八");
			put("2-22", "地高八");
			put("2-38", "地中八");
			put("2-35", "地地八");
			put("8-10", "人高八");
			put("8-26", "人地八");
			put("4-20", "八爷");
			put("10-40", "梅高八");
			put("10-56", "梅地八");
			put("11-7", "虎高八");
			put("11-39", "虎中八");
			put("11-55", "虎地八");
			put("26-40", "红高八");
			put("26-56", "红地八");
			put("37-38", "武东八");
			put("37-35", "武西八");
			put("53-38", "武南八");
			put("53-35", "武北八");
			// =========================七点===================================
			put("12-37", "天高七");
			put("12-53", "天地七");
			put("2-37", "地高七");
			put("2-53", "地地七");
			put("8-41", "人高七");
			put("8-57", "人地七");
			put("4-38", "七爷");
			put("4-35", "小七爷");
			put("10-7", "梅高七");
			put("10-39", "梅中七");
			put("10-55", "梅地七");
			put("6-11", "长高七");
			put("20-38", "板高七");
			put("20-35", "板地七");
			put("11-22", "虎高七");
			put("11-38", "虎中七");
			put("11-35", "虎地七");
			put("26-7", "红高七");
			put("26-39", "红中七");
			put("26-55", "红地七");
			put("41-40", "武高七");
			put("41-56", "武地七");
			put("57-40", "杂高七");
			put("57-56", "杂地七");
			// =========================六点===================================
			put("12-4", "天高六");
			put("12-20", "天地六");
			put("2-4", "地高六");
			put("2-20", "地地六");
			put("8-40", "人高六");
			put("8-56", "人地六");
			put("10-6", "梅长六");
			put("10-22", "梅高六");
			put("10-38", "梅中六");
			put("10-35", "梅地六");
			put("6-26", "六爷");
			put("11-37", "虎高六");
			put("11-53", "虎地六");
			put("26-22", "红高六");
			put("26-38", "红中六");
			put("26-35", "红地六");
			put("7-41", "高脚六");
			put("7-57", "高地六");
			put("41-39", "武高六");
			put("41-55", "武地六");
			put("57-39", "杂高六");
			put("57-55", "杂地六");
			// ========================五点================================
			put("56-55", "杂北五");
			put("56-39", "杂南五");
			put("40-55", "杂西五");
			put("40-39", "杂东五");
			put("41-38", "武东五");
			put("41-35", "武西五");
			put("57-38", "武南五");
			put("57-35", "武北五");
			put("7-40", "高脚五");
			put("7-56", "高地五");
			put("22-41", "铜高五");
			put("22-57", "铜地五");
			put("26-37", "红高武");
			put("26-53", "红地五");
			put("20-11", "板高五");
			put("6-41", "长高五");
			put("6-57", "长地五");
			put("10-37", "梅中五");
			put("10-53", "梅地五");
			put("8-7", "人高五");
			put("8-39", "人中五");
			put("8-55", "人地五");
			put("4-11", "五爷");
			// ========================四点======================================
			put("12-2", "天高四");
			put("8-6", "人长四");
			put("8-22", "人高四");
			put("8-38", "人中四");
			put("8-35", "人地四");
			put("4-10", "四爷");
			put("4-26", "小四爷");
			put("10-20", "梅花四");
			put("6-40", "长高四");
			put("6-56", "长地四");
			put("20-26", "板凳四");
			put("7-39", "高脚四");
			put("7-55", "高地四");
			put("22-40", "铜高四");
			put("22-56", "铜地四");
			put("41-37", "武东四");
			put("41-53", "武西四");
			put("57-37", "武南四");
			put("57-53", "武北四");
			put("40-38", "杂东四");
			put("40-35", "杂西四");
			put("56-38", "杂南四");
			put("56-35", "杂北四");
			// ========================三点======================================
			put("55-35", "杂北叁");
			put("55-38", "杂南叁");
			put("39-35", "杂西叁");
			put("39-38", "杂东叁");
			put("56-53", "武北叁");
			put("56-53", "武南叁");
			put("40-53", "武西叁");
			put("40-37", "武东叁");
			put("22-55", "铜地叁");
			put("22-39", "铜高叁");
			put("7-35", "高地叁");
			put("7-38", "高中叁");
			put("7-22", "高脚叁");
			put("20-57", "板地叁");
			put("20-41", "板高叁");
			put("6-55", "长地叁");
			put("6-39", "长中叁");
			put("6-7", "长高叁");
			put("4-57", "小叁爷");
			put("4-41", "叁爷");
			put("8-53", "人地叁");
			put("8-37", "人高叁");
			put("2-11", "地高叁");
			put("12-11", "天高叁");
			// ========================二点======================================
			put("55-53", "杂北二");
			put("55-37", "杂南二");
			put("39-53", "杂西二");
			put("39-37", "杂东二");
			put("7-53", "高地二");
			put("7-37", "高脚二");
			put("20-56", "板地二");
			put("20-40", "板高二");
			put("6-22", "长高二");
			put("4-56", "小二爷");
			put("4-40", "二爷");
			put("8-20", "人地二");
			put("8-4", "人高二");
			put("2-26", "地地二");
			put("2-10", "地高二");
			put("12-26", "天地二");
			put("12-10", "天高二");
			// ========================一点======================================
			put("22-53", "铜地一");
			put("22-37", "铜高一");
			put("11-26", "虎头一");
			put("20-55", "板地一");
			put("20-39", "板中一");
			put("20-7", "板高一");
			put("6-53", "长地一");
			put("6-37", "长高一");
			put("10-11", "梅一一");
			put("4-55", "小小爷");
			put("4-39", "小爷");
			put("4-7", "大爷");
			// ========================零点======================================
			put("11-41", "虎高零");
			put("20-22", "板高零");
			put("6-20", "长高零");
			put("10-26", "梅零零");
			put("4-22", "爷高零");
			put("4-6", "爷长零");
			put("11-57", "虎地零");
		}
	};

	// 花色
	public static final String COLOR[] = { "0", "方块", "梅花", "红心", "黑桃", "" };
	// 牌
	public static final String CARD[] = { "0", "A", "2", "3", "4", "5", "6", "7", "8", "9", "10", "J", "Q", "K", "小王",
			"大王" };

	// 获取牌
	public static final String getCardStr(int card) {
		int result = card / 16; // 求商
		int mod = card % 16; // 求余
		return COLOR[result] + CARD[mod];
	}

	/**
	 * 二八杠数字和名称的对应数组
	 */
	public static final String TWOEIGHTBAR_CARD_ARRAY[] = new String[] { "0", "一筒", "二筒", "三筒", "四筒", "五筒", "六筒", "七筒",
			"八筒", "九筒", "白板" };

	/**
	 * 棋牌的游戏id数组
	 */
	public static final Long CARD_ID_ARRAY[] = new Long[] { 22l, 1002l, 1003l };

	/**
	 * 龙虎斗数组对应押注
	 */
	public static final String DRAGON_AND_TIGER_ARRAY[] = new String[] { "龙", "虎", "和", "龙方", "龙梅", "龙红", "龙黑", "虎方",
			"虎梅", "虎红", "虎黑", "押庄赢", "押庄输" };

	/**
	 * 百家乐数组对应押注
	 */
	public static final String BACCARAT_ARRAY[] = new String[] { "闲", "庄", "和", "小", "大", "闲对", "庄对", "上庄赢", "上庄输" };

	/**
	 * 百人诈金花
	 */
	public static final String FRAUDULENT_FLOWER_ARRAY[] = new String[] { "东", "南", "西", "北", "对子", "顺子", "金花", "顺金",
			"炸弹" };

	/**
	 * 百人牛牛
	 */
	public static final String BAIREN_NIUNIU_ARRAY[] = new String[] { "黑", "红", "梅", "方" };
	
	/**
	 * 百人经典牛牛
	 */
	public static final String BAIREN_JINGDIAN_NIUNIU_ARRAY[] = new String[] { "青龙", "白虎", "玄武", "朱雀" };

	/**
	 * 龙虎斗和百家乐对应的庄赢庄输庄和数组
	 */
	public static final String BANKER_WIN[] = { "庄和", "庄赢", "庄输" };

	/**
	 * 百人牌九闲家
	 */
	public static final String PAIJIU_IDLE[] = { "天", "地", "人" };

	/**
	 * 百人牌九下注区域
	 */
	public static final String PAIJIU_AREA[] = { "天赢", "天输", "地赢", "地输", "人赢", "人输", "天托", "至尊" };

}
